## Pandas aggregation and Pivot Tables

In [48]:
# import 

import pandas as pd 
import  numpy as np

### Data loading

In [49]:
# Data loading
df_titanic =  pd.read_csv("./data/titanic.csv")
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1.0,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2.0,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3.0,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S
3,4.0,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,5.0,0.0,3,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,NaN,S

### Data Cleaning

In [50]:
df_titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            182
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          789
Embarked       102
dtype: int64

In [51]:
df_titanic = df_titanic.drop("Cabin",axis=1)

In [52]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1391 entries, 0 to 1390
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1391 non-null   float64
 1   Survived     1391 non-null   float64
 2   Pclass       1391 non-null   object
 3   Name         1391 non-null   object
 4   Sex          1391 non-null   object
 5   Age          1209 non-null   float64
 6   SibSp        1391 non-null   float64
 7   Parch        1391 non-null   float64
 8   Ticket       1391 non-null   object
 9   Fare         1391 non-null   float64
 10  Embarked     1289 non-null   object
dtypes: float64(6), object(5)
memory usage: 119.7+ KB

In [53]:
# remove duplicates
df_titanic = df_titanic.drop_duplicates()

In [54]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1291 entries, 0 to 1390
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1291 non-null   float64
 1   Survived     1291 non-null   float64
 2   Pclass       1291 non-null   object
 3   Name         1291 non-null   object
 4   Sex          1291 non-null   object
 5   Age          1109 non-null   float64
 6   SibSp        1291 non-null   float64
 7   Parch        1291 non-null   float64
 8   Ticket       1291 non-null   object
 9   Fare         1291 non-null   float64
 10  Embarked     1189 non-null   object
dtypes: float64(6), object(5)
memory usage: 121.0+ KB

### Group_by

In [55]:
df_titanic.groupby("Sex").head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1.0,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,S
1,2.0,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C
2,3.0,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,S
3,4.0,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,S
4,5.0,0.0,3,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,S
5,6.0,0.0,3,"Moran, Mr. James",male,NaN,0.0,0.0,330877,8.4583,Q
6,7.0,0.0,1,"McCarthy, Mr. Timothy J",male,54.0,0.0,0.0,17463,51.8625,S
7,8.0,0.0,3,"Palsson, Master. Gosta Leonard",male,2.0,3.0,1.0,349909,21.0750,S
8,9.0,1.0,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0.0,2.0,347742,11.1333,S
9,10.0,1.0,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1.0,0.0,237736,30.0708,C

In [56]:
# Groupby "sex" and find the average Fare For Each Sex
df_titanic.groupby("Sex")["Age"].mean()

Sex
female    28.922912
male      31.430946
Name: Age, dtype: float64

In [ ]:
df_titanic.groupby("Pclass")

In [57]:
df_titanic.groupby("Pclass")["Age"].mean()

Pclass
1    36.511812
2    29.263158
3    26.602111
?    32.493309
Name: Age, dtype: float64

In [58]:
df_titanic["Sex"].value_counts()

male      792
female    499
Name: Sex, dtype: int64

In [64]:
# Groupby "sex" "Pclass" and get the agg
df_titanic.groupby(["Sex","Pclass","Survived"])["Fare"].agg(["min","max","mean","count","median"])

                           min       max       mean  count   median
Sex    Pclass Survived
female 1      0.0       6.4375  151.5500  50.355983     23  28.7125
              1.0       7.1417  512.3292  91.949159    104  77.9583
       2      0.0       4.0125  221.7792  38.156694     33  13.0000
              1.0       4.0125   91.0792  22.825422     89  18.7500
       3      0.0       4.0125  262.3750  23.180603     93  14.4583
              1.0       7.0500   91.0792  16.705527     95  11.1333
       ?      0.0       7.0542  153.4625  38.793454     28  15.1000
              1.0       7.2250  227.5250  58.507229     34  36.2500
male   1      0.0       0.0000  263.0000  51.860511    107  32.3208
              1.0       0.0000  512.3292  60.605811     71  30.0000
       2      0.0       0.0000  113.2750  22.390398    115  13.5000
              1.0       8.1375  247.5208  45.800520     40  26.0000
       3      0.0       0.0000  227.5250  14.859570    306   7.9250
              1.0       0.0000  512.3292  28.330284     67   9.8417
       ?      0.0       0.0000  108.9000  23.798439     56  12.8750
              1.0       0.0000  247.5208  37.402360     30  28.1104

### Pivot Tables

The pivot() function in pandas is used to create a pivot table from a DataFrame. It allows you to summarize and aggregate data in a very flexible way.

```python

DataFrame.pivot(
    index=None,
    columns=None, 
    values=None)

```


Parameters:

    index: column or array-like — Column(s) to use as the new index.
    columns: column or array-like — Column(s) to use as the new columns.
    values: column or array-like — The column(s) to use for the values in the new DataFrame.

### Pivot Table

pivot table to count the number of passegers per class

In [ ]:
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1.0,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,S
1,2.0,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C
2,3.0,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,S
3,4.0,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,S
4,5.0,0.0,3,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,S

In [ ]:
# pivot table
df_titanic.pivot(columns="Sex",values=["Age","Fare"]).mean()

      Sex
Age   female    28.513643
      male      31.171461
Fare  female    43.683847
      male      30.927626
dtype: float64

#### Pivoting Titanic Data to Show Average Age for Each Survival Group

In [ ]:
# a pivot table on "Survived"
df_titanic.pivot(columns="Survived",values="Age").mean()

Survived
0.0    30.790976
1.0    29.196028
dtype: float64

In [ ]:
df_titanic.pivot(columns="Survived")["Age"].mean()

Survived
0.0    30.790976
1.0    29.196028
dtype: float64

### Pivot table with aggregate functions

Common Aggregation Functions in Pandas:

    Sum (sum): Adds up all the values in a column or group.
    Mean (mean): Computes the average of the values in a column or group.
    Count (count): Counts the number of non-NA/null entries in a column or group.
    Minimum (min): Finds the smallest value in a column or group.
    Maximum (max): Finds the largest value in a column or group.
    Standard Deviation (std): Computes the standard deviation of the values in a column or group.
    Variance (var): Computes the variance of the values in a column or group.
    Median (median): Finds the middle value in a column or group.
    First (first): Returns the first value in a column or group.
    Last (last): Returns the last value in a column or group.

In [67]:
df_titanic.pivot(columns="Survived")["Age"].agg(["min","max","mean","count"])

              0.0         1.0
min      0.420000    0.420000
max     74.000000   80.000000
mean    31.175899   29.432295
count  634.000000  475.000000

In [ ]:
# pivot with aggregate functions 
df_titanic.pivot(columns="Survived",values="Age").agg(["min","max","mean","count"])

              0.0         1.0
min      0.420000    0.420000
max     74.000000   80.000000
mean    30.790976   29.196028
count  584.000000  423.000000

### Multiple Columns

In [ ]:
# pivoting on multiple columns 
df_titanic.pivot(columns=["Sex","Pclass"],values=["Fare"]).agg(["min","max","mean","count"])

            Fare                                                              \
            male      female                    male      female        male
               3           1           3           1           2           2
min      0.00000    6.437500    4.012500    0.000000    4.012500    5.000000
max    512.32920  512.329200  262.375000  512.329200  221.779200  135.633300
mean    17.34828   86.670048   20.737562   61.852686   25.676072   26.739043
count  274.00000  106.000000  139.000000  138.000000  105.000000  135.000000


           female        male
                ?           ?
min      7.125000    0.000000
max    227.525000  247.520800
mean    54.596615   31.226682
count   48.000000   62.000000